COURSE_ACTS(COURSE_BOB, _("　１　ボムへいの　せんじょう"),
       _("やまのうえの　ボムキング")    , _("そらのしままで　ぶっとべ")    , _("はくねつ のこのこレース"),
       _("そらにはばたけ　はねマリオ")  , _("ワンワンの　いぬごやで")  , _("８まいの　あかコイン"))

COURSE_ACTS(COURSE_WF, _("　２　バッタンキングの　とりで"),
       _("いかりのバッタン　キング")    , _("とりでの　てっぺんへ")        , _("たいほうで　ひとっとび"),
       _("おおぞらに はばたけ")        , _("カベなんか ぶっとばせ")        , _("うきしまの　８まいコイン"))

COURSE_ACTS(COURSE_JRB, _("　３　かいぞくの　いりえ"),
       _("ちんぼつせんの　おたから")    , _("たいけつ きょだいウツボ")    , _("かいぞくの どうくつ"),
       _("たいほうで ひとっとび")  , _("ふきだす　みずを　くぐれ")  , _("うかんだフネの あかコイン"))

COURSE_ACTS(COURSE_CCM, _("　４　さむいさむい　マウンテン"),
       _("スーパースノースライダー")    , _("まいごの　こペンギン")        , _("ペンギン レース"), 
       _("ゴロゴロ　ゆきダルマ")  , _("かくれスーパー カベキック")        , _("すべって　８まいあかコイン"))

COURSE_ACTS(COURSE_BBH, _("　５　テレサの　ホラーハウス"),
       _("おやかたテレサを　さがせ")    , _("テレサの メリーゴランド")  , _("ほんだなオバケの スター"),
       _("バルコニーの　ボステレサ")    , _("かくしべやの　おおめだま")    , _("８まいコインは　どこだ"))

COURSE_ACTS(COURSE_HMC, _("　６　やみにとける　どうくつ"),
       _("ドルフィーの ちかすいげん")    , _("メタルでダッシュ")  , _("キリの めいろのスター"), 
       _("キリの めいろを ぬけて")      , _("ゴロゴロいわの　ひみつ"), _("そうさリフトの　あかコイン"))

COURSE_ACTS(COURSE_LLL, _("　７　ファイアバブル　ランド"), 
       _("おとせ ボスどすこい")        , _("どひょうで たいけつ")      , _("コロコロ　まるたわたり"),
       _("かざんの　パワースター")   , _("ほのうの じどうリフト")      , _("１５パズルの　８まいコイン"))

COURSE_ACTS(COURSE_SSL, _("　８　あっちっち　さばく"),
       _("いたずらハゲタカ ジャンゴ")  , _("スクエアのめいろで")    , _("きょだいピラミッドの なか"),
       _("３つのはしらに　たつものへ")  , _("きょだいピラミッドのナゾ")    , _("とびまわれ　８まいコイン"))

COURSE_ACTS(COURSE_DDD, _("　９　ウォーター　ランド"),
       _("クッパの　せんすいかん")      , _("かいぞくの たからばこ")      , _("ふきだすみず をくぐり"),
       _("マンタの　おくりもの")    , _("アイテムが そろったら")        , _("にげたクッパの　あかコイン"))

COURSE_ACTS(COURSE_SL, _("１０　スノーマンズ　ランド"),
       _("おおゆきだるまの あたま")    , _("こおりのいけで どすこい")    , _("こおりの　オブジェ"),
       _("つめたい　いけを　こえて")    , _("フワフワさんの　おうち")  , _("コウラにのって　あかコイン"))

COURSE_ACTS(COURSE_WDW, _("１１　みずびたシティー"),
       _("あさせで よいしょ")      , _("トップオブ ザ シティー")    , _("かなあみの エレベーター"),
       _("あふれるみずの まち"), _("みずのまちの ひみつ")  , _("ダウンタウンを　かけろ"))

COURSE_ACTS(COURSE_TTM, _("１２　たかいたかいマウンテン"),
       _("どでかマウンテン てっぺん")    , _("いたずらザル　ウッキィのオリ"), _("マウンテン　スライダー"),
       _("はしのうえで みわたせば")      , _("はなれキノコのパワースター")  , _("おばけキノコの　あかコイン"))

COURSE_ACTS(COURSE_THI, _("１３　ちびでか　アイランド"),
       _("きょだいパックンフラワー")    , _("デカじまの　てっぺんで")      , _("チビの せかいの こじま"),
       _("おきの ちいさなしま")  , _("スターオンザホール")    , _("ハナチャンの　あかコイン"))

COURSE_ACTS(COURSE_TTC, _("１４　チックタックロック"),
       _("あなあき かご")      , _("ふりこの　へや")              , _("はりを つたって"),
       _("てっぺんの とけいキング"), _("カゴのなかの パワースター")      , _("００ふんの　あかコイン"))

COURSE_ACTS(COURSE_RR, _("１５　レインボー　クルーズ"),
       _("にじを　わたる　ふね")        , _("てんくうの ろうかく")        , _("カゼきる　きょだいブランコ"),
       _("ジャンプ アスレチック")  , _("にじの　かなたの　しま")      , _("タテめいろの　あかコイン"))

SECRET_STAR(COURSE_BITDW,    _("　　　やみの　せかいの　クッパ"))
SECRET_STAR(COURSE_BITFS,    _("　　　ほのおの　うみの　クッパ"))
SECRET_STAR(COURSE_BITS,     _("　　　てんくうの　たたかい！"))
SECRET_STAR(COURSE_PSS,      _("　　　ピーチのかくれスライダー"))
SECRET_STAR(COURSE_COTMC,    _("　　　メタルスイッチの　たき"))
SECRET_STAR(COURSE_TOTWC,    _("　　　はばたけ！はねスイッチへ"))
SECRET_STAR(COURSE_VCUTM,    _("　　　おほりのとうめいスイッチ"))
SECRET_STAR(COURSE_WMOTR,    _("　　　にじ　かける　はねマリオ"))
SECRET_STAR(COURSE_SA,       _("　　　おさかなと　いっしょ"))
SECRET_STAR(COURSE_CAKE_END, _("　　　おいしいケーキ"))

CASTLE_SECRET_STARS(_("　　　おしろのかくれスター"))

EXTRA_TEXT(0, _("おしろのかくれスター"))
EXTRA_TEXT(1, _("１００まいコインの　スター"))
EXTRA_TEXT(2, _("マウンテンのへやが　ひらく！"))
EXTRA_TEXT(3, _("みずとゆき２つのへやが　ひらく！"))
EXTRA_TEXT(4, _("おおきなほしの　ドアがひらく！"))
EXTRA_TEXT(5, _("クッパへの　とびらがひらく！"))
EXTRA_TEXT(6, _("３がいへの　とびらがひらく！"))

//私は日本語を少しも知らないので、これは非常に分かりにくいです、ああ、くそ。